VitaProgEmb/esp32_dmx_to_ws2812/dmx_sniffer/sdkconfig.defaults
# ESP32-S3 DMX Sniffer + W5500 Ethernet
# Flash: 8MB, PSRAM: 8MB

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi (оставляем для fallback)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# W5500 Ethernet
CONFIG_ETH_SPI_ETHERNET_W5500=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
